[
  {
    "id": "1754208897292",
    "title": "Software Engineer",
    "company": "HCL",
    "description": "Java Developer with over 5 years of experience"
  },
  {
    "id": "1754214868470",
    "title": "Full Stack Engineer",
    "company": "Infosys",
    "description": "About the job\nThe ideal candidate will be familiar with the full software design life cycle. They should have experience in designing, coding, testing and consistently managing applications They should be comfortable coding in a number of languages and have an ability to test code in order to maintain high-quality code.\n\n\nExp: 2-3 years\nLocation: Chennai\nMode of Work: Office\n\n\nYour Responsibilities:\n\nDevelop responsive, modular front-end components using React, TypeScript/JSX, and the MUI library.\nDesign and implement secure, scalable backend services with .NET 8 and C#.\nOptimize SQL queries and work with Azure SQL Server Managed Instances.\nPartner with product and design teams to transform requirements into functional features.\nIntegrate APIs and data sources with the UI, working across the full stack.\nContribute to design discussions, performance enhancements, and scalable system architecture.\nGrow into leadership by gradually owning features or modules.\nQualifications:\n\n2–3 years of full-stack development experience.\nStrong skills in React, JSX, TypeScript, and MUI.\nHands-on experience with .NET 8 and C#.\nSolid database knowledge, preferably with Azure SQL Server.\nUnderstanding of frontend-backend integration and API design.\nProactive mindset with a desire to take ownership and grow into leadership.\nExcellent communication skills and a collaborative approach."
  },
  {
    "id": "1754215455616",
    "title": "Javascript Developer - ReactJs",
    "company": "Cognizant",
    "description": "About the job\n\nRole: Frontend Developer\n\nExperience:6+ Years.\n\nLocation: Chennai Teynampet(WFO) 2pm-11pm\n\nMandatory Skills: React TypeScript and React 18 patterns\n\n\n\nFRONT END DEVELOPER- 1\n\n\nWhat You’ll Do\n\n • Build and maintain React applications with modern TypeScript and React 18 patterns\n • Translate product and design requirements into modular, scalable UI components\n • Optimize performance with code-splitting, lazy loading, and effective state management (Redux Toolkit, Zustand, or similar)\n • Implement responsive layouts with CSS-in-JS, Tailwind CSS, or PostCSS\n • Integrate with REST and GraphQL APIs and handle real-time updates via WebSockets or SSE\n • Write and maintain automated tests (Jest, React Testing Library, Playwright or Cypress)\n • Conduct code reviews, uphold accessibility and internationalization standards, and document components in Storybook\n • Collaborate daily with designers, backend engineers, and product managers to iterate quickly and ship polished features\n\n\nMust-Have Qualifications\n\n\n • Fluency in English, both written and spoken, for daily collaboration with distributed teams\n • 6 + years of professional frontend development experience, with 3 + years building production React applications\n • Expert knowledge of TypeScript, React hooks, context, and modern state management approaches\n • Solid grasp of performance optimization techniques, Lighthouse auditing, and browser internals\n • Production experience consuming RESTful and/or GraphQL APIs and managing network and caching concerns\n • Strong testing discipline using Jest and React Testing Library, and familiarity with end-to-end testing tools\n • Proficiency with Git workflows and a collaborative code-review culture\n • Commitment to accessibility (WCAG), responsive design, and cross-browser compatibility\n\n\nNice-to-Have\n\n\n • Hands-on experience with Next.js 14 / 15 (App Router, server components, edge functions)\n • Familiarity with design systems and component-library tooling such as Storybook or Radix UI\n • Exposure to data-visualization libraries (Recharts, Victory, D3)\n • Experience deploying static or server-rendered front ends on AWS S3 + CloudFront, Vercel, or Netlify\n • Knowledge of CI/CD pipelines for frontend assets (GitLab CI, GitHub Actions)\n • Interest in AI and LLM-driven UX patterns, prompt design, and workflow automations\n\n\n Ready to Craft the Next Generation of AI Interfaces?\nSend us your résumé in English, and note that the entire hiring process, including every interview, will be conducted in English.\nApplying to this position authorizes Inbenta to process your personal data solely for recruitment purposes, per our Applicant Privacy Policy"
  },
  {
    "id": "1754251069890",
    "title": "UI/UX Designer",
    "company": "Google Inc.",
    "description": "This is not a generic dashboard gig — you'll work on real-time audio playback, legal text editing, and UX for busy judges. You'll also help shape our design system and collaborate with a small team of elite builders shipping impactful features fast.\n\n\n\n\n🔧 Responsibilities\nBuild and maintain production-grade frontends using Next.js, TypeScript, and TailwindCSS\nImplement seamless UX for audio recording, playback, and rich-text editing\nCollaborate closely with backend and design teams to ship end-to-end features\nUphold code quality through reviews and testing (Playwright / unit tests)\nProactively suggest and prototype new ideas to improve the product"
  }
]